Tekla Open API Reference for Tekla Structures 2025
CustomPartBase.Identifier Property
 The identifier of the executable plug-in instance.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Identifier Identifier { get; }
Public ReadOnly Property Identifier As Identifier
	Get
Property Value
Type: Identifier
See Also
Reference
CustomPartBase Class
Tekla.Structures.Plugins Namespace